---
kind: other
id: Methods.T:Autodesk.Revit.DB.Structure.RebarShapeSegment
source: html/58cf28c7-649e-13e4-299f-23a236fa577c.htm
---
# RebarShapeSegment Methods

Retrieve the list of constraints associated with this segment.